// var age=19;
var transport="мопед";
	// alert("вы взрослый");}

	// else if (age===21) {
	// 	alert("Держите пиво.");
	// }
	// else if (age===24) {
	// 	alert("Держите водку.");}
	// else if (age===33){
	// 	alert("Держите за селедку.");
	// }
	// else if (age===88){
	// 	alert("Держите яйца.");
	// }

	// (age===18) ? alert("вы взрослый"): 			
	// 		(age===21) ?  alert("Держите пиво"):
	// 		(age===24) ?  alert("Держите водку"):
	// 		(age===33) ? alert("Держите за селедку"):
	// 		(age===88) ? alert("Держите яйца"):
	// 		alert("Держите яйца.условие не прошло.операнд ?");
	// ________________________________________________		
	// 	 Логические операторы
 // || оператор или.
 // && оператор и.
 // ! оператор НЕ

						// (age >=18 && age<=50) ? alert("вы взрослый"):
 					// 	alert("Держите яйца.условие не прошло.операнд ?");

 					// (transport==="Пассатик Б3" || transport === "Велосипед с западного_)") ? alert("вы доедите до 19/1 "):
 					// alert("Хрен вы куда доедеите");
 					(transport !== "Велосипед с западного_)") ? alert("вы доедите до 19/1 "):
 					alert("Хрен вы куда доедеите")